CSI API ETABS v1
cPropArea.SetDeckSolidSlab Method
 Initializes a solid-slab deck property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDeckSolidSlab(
	string Name,
	double SlabDepth,
	double ShearStudDia,
	double ShearStudHt,
	double ShearStudFu
)
Function SetDeckSolidSlab (
	Name As String,
	SlabDepth As Double,
	ShearStudDia As Double,
	ShearStudHt As Double,
	ShearStudFu As Double
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim SlabDepth As Double
Dim ShearStudDia As Double
Dim ShearStudHt As Double
Dim ShearStudFu As Double
Dim returnValue As Integer
returnValue = instance.SetDeckSolidSlab(Name,
	SlabDepth, ShearStudDia, ShearStudHt,
	ShearStudFu)
int SetDeckSolidSlab(
	String^ Name,
	double SlabDepth,
	double ShearStudDia,
	double ShearStudHt,
	double ShearStudFu
)
abstract SetDeckSolidSlab :
        Name : string *
        SlabDepth : float *
        ShearStudDia : float *
        ShearStudHt : float *
        ShearStudFu : float -> int
Parameters
Name
Type: System.String
 The name of an existing deck property created with the SetDeck(String, eDeckType, eShellType, String, Double, Int32, String, String) function.
SlabDepth
Type: System.Double
 Slab Depth, tc
ShearStudDia
Type: System.Double
 Shear Stud Diameter
ShearStudHt
Type: System.Double
 Shear Stud Height, hs
ShearStudFu
Type: System.Double
 Shear Stud Tensile Strength, Fu
Return Value
Type: Int32
 Returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DeckType As eDeckType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim SlabDepth As Double
       Dim ShearStudDia As Double
       Dim ShearStudHt As Double
       Dim ShearStudFu As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetDeck("MyShellProp1A", eDeckType.SolidSlab, eShellType.ShellThin, "4000Psi", 14)
   'set new area property
       ret = SapModel.PropArea.SetDeckSolidSlab(Name:="MyShellProp1A", SlabDepth:=3.5, ShearStudDia:=0.75, ShearStudHt:=6, ShearStudFu:=65000)
   'get area property data
       ret = SapModel.PropArea.GetDeck("MyShellProp1A", DeckType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetDeckSolidSlab("MyShellProp1A", SlabDepth, ShearStudDia, ShearStudHt, ShearStudFu)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace